In [2]:
import pandas as pd
import numpy as np

In [3]:

df =pd.read_csv('/content/drive/MyDrive/concept of AI/Titanic-Dataset.csv')

In [5]:
#Task 3.1 Problem 1 - 1
import pandas as pd


fare = df[["Fare"]]

print(fare.head())

      Fare
0   7.2500
1  71.2833
2   7.9250
3  53.1000
4   8.0500

In [6]:
#Task 3.1 Problem 1 - 2


class_age = df[["Pclass", "Age"]]

print(class_age.head())

   Pclass   Age
0       3  22.0
1       1  38.0
2       3  26.0
3       1  35.0
4       3  35.0

In [7]:
#Task 3.1 Problem 1 - 3

survived_gender = df[["Survived", "Sex"]]

print(survived_gender.head())

   Survived     Sex
0         0    male
1         1  female
2         1  female
3         1  female
4         0    male

In [8]:
#Task 3.1 Problem 2 - 1

fare_gt_100 = df[df["Fare"] > 100]

print(fare_gt_100.head())

     PassengerId  Survived  Pclass  \
27            28         0       1
31            32         1       1
88            89         1       1
118          119         0       1
195          196         1       1

                                               Name     Sex   Age  SibSp  \
27                   Fortune, Mr. Charles Alexander    male  19.0      3
31   Spencer, Mrs. William Augustus (Marie Eugenie)  female   NaN      1
88                       Fortune, Miss. Mabel Helen  female  23.0      3
118                        Baxter, Mr. Quigg Edmond    male  24.0      0
195                            Lurette, Miss. Elise  female  58.0      0

     Parch    Ticket      Fare        Cabin Embarked
27       2     19950  263.0000  C23 C25 C27        S
31       0  PC 17569  146.5208          B78        C
88       2     19950  263.0000  C23 C25 C27        S
118      1  PC 17558  247.5208      B58 B60        C
195      0  PC 17569  146.5208          B80        C

In [9]:
#Task 3.1 Problem 2 - 2

first_class = df[df["Pclass"] == 1]

print(first_class.head())

    PassengerId  Survived  Pclass  \
1             2         1       1
3             4         1       1
6             7         0       1
11           12         1       1
23           24         1       1

                                                 Name     Sex   Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                             McCarthy, Mr. Timothy J    male  54.0      0
11                           Bonnell, Miss. Elizabeth  female  58.0      0
23                       Sloper, Mr. William Thompson    male  28.0      0

    Parch    Ticket     Fare Cabin Embarked
1       0  PC 17599  71.2833   C85        C
3       0    113803  53.1000  C123        S
6       0     17463  51.8625   E46        S
11      0    113783  26.5500  C103        S
23      0    113788  35.5000    A6        S

In [10]:
#Task 3.1 Problem 2 - 3

female_under_18 = df[(df["Age"] < 18) & (df["Sex"] == "female")]

print(female_under_18.head())

    PassengerId  Survived  Pclass                                  Name  \
9            10         1       2   Nasser, Mrs. Nicholas (Adele Achem)
10           11         1       3       Sandstrom, Miss. Marguerite Rut
14           15         0       3  Vestrom, Miss. Hulda Amanda Adolfina
22           23         1       3           McGowan, Miss. Anna "Annie"
24           25         0       3         Palsson, Miss. Torborg Danira

       Sex   Age  SibSp  Parch   Ticket     Fare Cabin Embarked
9   female  14.0      1      0   237736  30.0708   NaN        C
10  female   4.0      1      1  PP 9549  16.7000    G6        S
14  female  14.0      0      0   350406   7.8542   NaN        S
22  female  15.0      0      0   330923   8.0292   NaN        Q
24  female   8.0      3      1   349909  21.0750   NaN        S

In [11]:
#Task 3.1 Problem 2 - 3

female_under_18 = df[(df["Age"] < 18) & (df["Sex"] == "female")]

print(female_under_18.head())

    PassengerId  Survived  Pclass                                  Name  \
9            10         1       2   Nasser, Mrs. Nicholas (Adele Achem)
10           11         1       3       Sandstrom, Miss. Marguerite Rut
14           15         0       3  Vestrom, Miss. Hulda Amanda Adolfina
22           23         1       3           McGowan, Miss. Anna "Annie"
24           25         0       3         Palsson, Miss. Torborg Danira

       Sex   Age  SibSp  Parch   Ticket     Fare Cabin Embarked
9   female  14.0      1      0   237736  30.0708   NaN        C
10  female   4.0      1      1  PP 9549  16.7000    G6        S
14  female  14.0      0      0   350406   7.8542   NaN        S
22  female  15.0      0      0   330923   8.0292   NaN        Q
24  female   8.0      3      1   349909  21.0750   NaN        S

In [13]:
#Task 3.1 Problem 2 Subesetting row by categorial variables - 1

embarked_c_or_s = df[(df["Embarked"] == "C") | (df["Embarked"] == "S")]

print(embarked_c_or_s)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
884          885         0       3
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
884                             Sutehall, Mr. Henry Jr    male  25.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
884      0   SOTON/OQ 392076   7.0500   NaN        S
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C

[812 rows x 12 columns]

In [14]:
#Task 3.1 Problem 2 Subesetting row by categorial variables - 2

first_second_class = df[df["Pclass"].isin([1,2])]

print(first_second_class)

     PassengerId  Survived  Pclass  \
1              2         1       1
3              4         1       1
6              7         0       1
9             10         1       2
11            12         1       1
..           ...       ...     ...
880          881         1       2
883          884         0       2
886          887         0       2
887          888         1       1
889          890         1       1

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                              McCarthy, Mr. Timothy J    male  54.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
11                            Bonnell, Miss. Elizabeth  female  58.0      0
..                                                 ...     ...   ...    ...
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
883                      Banfield, Mr. Frederick James    male  28.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
889                              Behr, Mr. Karl Howell    male  26.0      0

     Parch            Ticket     Fare Cabin Embarked
1        0          PC 17599  71.2833   C85        C
3        0            113803  53.1000  C123        S
6        0             17463  51.8625   E46        S
9        0            237736  30.0708   NaN        C
11       0            113783  26.5500  C103        S
..     ...               ...      ...   ...      ...
880      1            230433  26.0000   NaN        S
883      0  C.A./SOTON 34068  10.5000   NaN        S
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
889      0            111369  30.0000  C148        C

[400 rows x 12 columns]

In [15]:
#Task 3.2
#Which passenger had the highest fare paid relative to their age?

df['Age'] = df["Age"].fillna(df['Age'].median())

df['Fare_per_year'] = df['Fare'] / df['Age']

high_fare_age = df[df['Fare_per_year'] > 5]

high_fare_age_srt = high_fare_age.sort_values(by='Fare_per_year', ascending=False)

result = high_fare_age_srt[['Name', 'Fare_per_year']]

print(result)

                                               Name  Fare_per_year
305                  Allison, Master. Hudson Trevor     164.728261
297                    Allison, Miss. Helen Loraine      75.775000
386                 Goodwin, Master. Sidney Leonard      46.900000
164                    Panula, Master. Eino Viljami      39.687500
183                       Becker, Master. Richard F      39.000000
..                                              ...            ...
348          Coutts, Master. William Loch "William"       5.300000
31   Spencer, Mrs. William Augustus (Marie Eugenie)       5.232886
205                      Strom, Miss. Telma Matilda       5.231250
813              Andersson, Miss. Ebba Iris Alfrida       5.212500
480                  Goodwin, Master. Harold Victor       5.211111

[71 rows x 2 columns]

In [16]:
#Task 3.2
#Which adult male passenger (age ≥ 18 and Sex is ’male’) paid the highest fare relative to their class?

df['Age'] = df["Age"].fillna(df['Age'].median())

df["Fare_per_class"] = df["Fare"] / df["Pclass"]

adult_males = df[(df['Age'] >= 18) & (df['Sex'] == 'male')]

adult_males_srt = adult_males.sort_values(by='Fare_per_class', ascending=False)

result = adult_males_srt[['Name', 'Age', 'Fare_per_class']]

print(result)

                                   Name   Age  Fare_per_class
737              Lesurer, Mr. Gustave J  35.0        512.3292
679  Cardeza, Mr. Thomas Drake Martinez  36.0        512.3292
438                   Fortune, Mr. Mark  64.0        263.0000
27       Fortune, Mr. Charles Alexander  19.0        263.0000
118            Baxter, Mr. Quigg Edmond  24.0        247.5208
..                                  ...   ...             ...
806              Andrews, Mr. Thomas Jr  39.0          0.0000
481    Frost, Mr. Anthony Wood "Archie"  28.0          0.0000
413      Cunningham, Mr. Alfred Fleming  28.0          0.0000
466               Campbell, Mr. William  28.0          0.0000
271        Tornquist, Mr. William Henry  25.0          0.0000

[519 rows x 3 columns]

In [19]:
#Task 3.3
#What percent of the total fare revenue came from each passenger class?
#3.3-1
total_fare = df['Fare'].sum()
total_fare

28693.9493

In [21]:
#3.3-2
first_class_fare = df[df['Pclass'] == 1]['Fare'].sum()
first_class_fare

18177.4125

In [23]:
#3.3-3
second_class_fare = df[df['Pclass'] == 2]['Fare'].sum()
second_class_fare

third_class_fare = df[df['Pclass'] == 3]['Fare'].sum()
third_class_fare

6714.6951

In [24]:
#3.3-4

fare_total = [first_class_fare, second_class_fare, third_class_fare]
fare_total

[63.349287718996564, 13.24962855496507, 23.401083726038365]

In [25]:
#3.3-5
proportion_of_fare = [(fare / total_fare) * 100 for fare in fare_total]
proportion_of_fare

[63.349287718996564, 13.24962855496507, 23.401083726038365]

In [26]:
#Task3.3
#What percent of the total number of passengers on the Titanic belonged to each age group (e.g., child, adult, senior)?

# 1.
def categorize_age(age):
    if age < 18:
        return 'child'
    elif age < 65:
        return 'adult'
    else:
        return 'senior'

df['age_group'] = df['Age'].apply(categorize_age)

In [27]:
# 3.3
# 2.

total_passengers = len(df)
total_passengers

891

In [28]:
# 3.3
# 3.
count_age_group = df['Age'].value_counts()
count_age_group

Age
28.00    202
24.00     30
22.00     27
18.00     26
19.00     25
        ...
36.50      1
55.50      1
0.92       1
23.50      1
74.00      1
Name: count, Length: 88, dtype: int64

In [29]:
# 3.3
# 4.
age_group_proportions = (count_age_group / total_passengers) * 100
age_group_proportions

Age
28.00    22.671156
24.00     3.367003
22.00     3.030303
18.00     2.918070
19.00     2.805836
           ...
36.50     0.112233
55.50     0.112233
0.92      0.112233
23.50     0.112233
74.00     0.112233
Name: count, Length: 88, dtype: float64

In [30]:
# 3.3
# 5.
for group, proportion in age_group_proportions.items():
    print(f"{str(group).capitalize()}: {proportion:.2f}%")

28.0: 22.67%
24.0: 3.37%
22.0: 3.03%
18.0: 2.92%
19.0: 2.81%
30.0: 2.81%
21.0: 2.69%
25.0: 2.58%
36.0: 2.47%
29.0: 2.24%
35.0: 2.02%
26.0: 2.02%
27.0: 2.02%
32.0: 2.02%
16.0: 1.91%
31.0: 1.91%
34.0: 1.68%
20.0: 1.68%
33.0: 1.68%
23.0: 1.68%
39.0: 1.57%
40.0: 1.46%
17.0: 1.46%
42.0: 1.46%
45.0: 1.35%
38.0: 1.23%
50.0: 1.12%
2.0: 1.12%
4.0: 1.12%
44.0: 1.01%
48.0: 1.01%
47.0: 1.01%
54.0: 0.90%
9.0: 0.90%
1.0: 0.79%
51.0: 0.79%
14.0: 0.67%
52.0: 0.67%
37.0: 0.67%
49.0: 0.67%
41.0: 0.67%
3.0: 0.67%
58.0: 0.56%
15.0: 0.56%
43.0: 0.56%
62.0: 0.45%
56.0: 0.45%
5.0: 0.45%
11.0: 0.45%
60.0: 0.45%
8.0: 0.45%
6.0: 0.34%
46.0: 0.34%
61.0: 0.34%
65.0: 0.34%
7.0: 0.34%
10.0: 0.22%
64.0: 0.22%
13.0: 0.22%
63.0: 0.22%
30.5: 0.22%
57.0: 0.22%
70.0: 0.22%
0.75: 0.22%
71.0: 0.22%
59.0: 0.22%
0.83: 0.22%
40.5: 0.22%
55.0: 0.22%
32.5: 0.22%
28.5: 0.22%
45.5: 0.22%
34.5: 0.11%
0.42: 0.11%
0.67: 0.11%
66.0: 0.11%
24.5: 0.11%
80.0: 0.11%
20.5: 0.11%
53.0: 0.11%
14.5: 0.11%
70.5: 0.11%
12.0: 0.11%
36.5: 0.11%
55.5: 0.11%
0.92: 0.11%
23.5: 0.11%
74.0: 0.11%